# Fall 2024 Data Science Track: Week 2 - Data Cleaning Exercise

## Packages, Packages, Packages!

Import *all* the things here! You need the standard stuff: `pandas` and `numpy`.

If you got more stuff you want to use, add them here too. üôÇ

In [1137]:
# Import here.
import pandas as pd
import numpy as np

## Introduction

With the packages out of the way, now you will be working with the following data sets:

* `food_coded.csv`: [Food choices](https://www.kaggle.com/datasets/borapajo/food-choices?select=food_coded.csv) from Kaggle
* `Ask A Manager Salary Survey 2021 (Responses) - Form Responses 1.tsv`: [Ask A Manager Salary Survey 2021 (Responses)](https://docs.google.com/spreadsheets/d/1IPS5dBSGtwYVbjsfbaMCYIWnOuRmJcbequohNxCyGVw/view?&gid=1625408792) as *Tab Separated Values (.tsv)* from Google Docs

Each one poses different challenges. But you‚Äôll‚Äïof course‚Äïovercome them with what you learned in class! üòâ

## Food Choices Data Set

### Load the Data

In [1138]:
# Load the Food choices data set into a variable (e.g., df_food).

food_data_set_path = 'data/food_coded.csv'

df_food = pd.read_csv(food_data_set_path)

### Explore the Data

How much data did you just load?

In [1139]:
# Count by hand. (lol kidding)
df_food.shape[0]

125

What are the columns and their types in this data set?

In [1140]:
# Show the column names and their types.
df_food.dtypes

GPA                  object
Gender                int64
breakfast             int64
calories_chicken      int64
calories_day        float64
                     ...
type_sports          object
veggies_day           int64
vitamins              int64
waffle_calories       int64
weight               object
Length: 61, dtype: object

### Clean the Data

Perhaps we‚Äôd like to know more another day, but the team is really interested in just the relationship between calories (`calories_day`) and weight. ‚Ä¶and maybe gender.

Can you remove the other columns?

In [1141]:
# Remove ‚Äòem.
truncated_df_food = df_food[['Gender', 'calories_day', 'weight']]
truncated_df_food

     Gender  calories_day                    weight
0         2           NaN                       187
1         1           3.0                       155
2         1           4.0  I'm not answering this.
3         1           3.0             Not sure, 240
4         1           2.0                       190
..      ...           ...                       ...
120       1           4.0                       156
121       1           2.0                       180
122       1           NaN                       120
123       2           4.0                       135
124       1           NaN                       135

[125 rows x 3 columns]

What about `NaN`s? How many are there?

In [1142]:
# Count ‚Äòem.
truncated_df_food.isnull().sum()

Gender           0
calories_day    19
weight           2
dtype: int64

We gotta remove those `NaN`s‚Äïthe entire row.

In [1143]:
# Drop ‚Äòem.
truncated_df_food = truncated_df_food.dropna()
truncated_df_food

     Gender  calories_day                    weight
1         1           3.0                       155
2         1           4.0  I'm not answering this.
3         1           3.0             Not sure, 240
4         1           2.0                       190
5         1           3.0                       190
..      ...           ...                       ...
118       1           3.0                       140
119       2           3.0                       185
120       1           4.0                       156
121       1           2.0                       180
123       2           4.0                       135

[104 rows x 3 columns]

But what about the weird non-numeric values in the column obviously meant for numeric data?

Notice the data type of that column from when you got the types of all the columns?

If only we could convert the column to a numeric type and drop the rows with invalid values. ü§î

In [1144]:
# Fix that.
# truncated_df_food.dtypes
truncated_df_food['weight'] = pd.to_numeric(truncated_df_food['weight'], errors='coerce')
truncated_df_food.dropna()

/var/folders/8b/80hh4jnn1xs8s6j0gf3_6lf80000gn/T/ipykernel_1508/4215358670.py:3: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  truncated_df_food['weight'] = pd.to_numeric(truncated_df_food['weight'], errors='coerce')

     Gender  calories_day  weight
1         1           3.0   155.0
4         1           2.0   190.0
5         1           3.0   190.0
6         2           3.0   180.0
7         1           3.0   137.0
..      ...           ...     ...
118       1           3.0   140.0
119       2           3.0   185.0
120       1           4.0   156.0
121       1           2.0   180.0
123       2           4.0   135.0

[101 rows x 3 columns]

Now this data seems reasonably clean for our purposes! üòÅ

Let‚Äôs save it somewhere to be shipped off to another teammate. üíæ

In [1145]:
# Savey save!
truncated_df_food.to_csv('data/truncated_df_food.csv')

## Ask a Manager Salary Survey 2021 (Responses) Data Set

### Load the Data

In [1146]:
# Load the Ask A Manager Salary Survey 2021 (Responses) data set into a variable (e.g., df_salary).
fp = 'data/ask_a_manager_salary_survey_2021(Responses).csv'
df_salary = pd.read_csv(fp, sep="\t")

Was that hard? üôÉ

#### rename the file to something that is better for all systems.  
* No spaces in filename (can use '_')
* all lower case

### Explore

You know the drill.

How much data did you just load?

In [1147]:
# Count by hand. I‚Äôm dead serious.
df_salary.shape[0]

28062

What are the columns and their types?

In [1148]:
# Show the column names and their types.
df_salary.dtypes

Timestamp                                                                                                                                                                                                                                object
How old are you?                                                                                                                                                                                                                         object
What industry do you work in?                                                                                                                                                                                                            object
Job title                                                                                                                                                                                                                                object
If your job title needs additional context, please clarify here:                                                                                                                                                                         object
What is your annual salary? (You'll indicate the currency in a later question. If you are part-time or hourly, please enter an annualized equivalent -- what you would earn if you worked the job 40 hours a week, 52 weeks a year.)     object
How much additional monetary compensation do you get, if any (for example, bonuses or overtime in an average year)? Please only include monetary compensation here, not the value of benefits.                                          float64
Please indicate the currency                                                                                                                                                                                                             object
If "Other," please indicate the currency here:                                                                                                                                                                                           object
If your income needs additional context, please provide it here:                                                                                                                                                                         object
What country do you work in?                                                                                                                                                                                                             object
If you're in the U.S., what state do you work in?                                                                                                                                                                                        object
What city do you work in?                                                                                                                                                                                                                object
How many years of professional work experience do you have overall?                                                                                                                                                                      object
How many years of professional work experience do you have in your field?                                                                                                                                                                object
What is your highest level of education completed?                                                                                                                                                                                       object
What is your gender?                                                                                                                                                                                                                     object
What is your race? (Choose all that apply.)                                                                                                                                                                                              object
dtype: object

Oh‚Ä¶ Ugh! Give these columns easier names to work with first. üôÑ

In [1149]:
# Rename ‚Äòem.
# Non-binding suggestions: timestamp, age, industry, title, title_context, salary, additional_compensation, currency, other_currency, salary_context, country, state, city, total_yoe, field_yoe, highest_education_completed	gender, race
new_col_names = ['timestamp', 'age', 'industry', 'title', 'title_context', 'salary', 'additional_compensation', 'currency', 'other_currency', 'salary_context', 'country', 'state', 'city', 'total_yoe', 'field_yoe', 'highest_education_completed', 'gender', 'race']
df_salary.columns = new_col_names
df_salary.dtypes

timestamp                       object
age                             object
industry                        object
title                           object
title_context                   object
salary                          object
additional_compensation        float64
currency                        object
other_currency                  object
salary_context                  object
country                         object
state                           object
city                            object
total_yoe                       object
field_yoe                       object
highest_education_completed     object
gender                          object
race                            object
dtype: object

It‚Äôs a lot, and that should not have been easy. üòè

You‚Äôre going to have a gander at the computing/tech subset first because thats *your* industry. But first, what value corresponds to that `industry`?

In [1150]:
# List the unique industries and a count of their instances.
df_salary['industry'].value_counts()

industry
Computing or Tech                          4699
Education (Higher Education)               2464
Nonprofits                                 2419
Health care                                1896
Government and Public Administration       1889
                                           ...
Gaming (Gambling)                             1
Regulatory Affairs- nutraceuticals            1
Manufacturing : corporate admin support       1
Real Estate Investment Support                1
Wine & Spirits                                1
Name: count, Length: 1219, dtype: int64

That value among the top 5 is what you‚Äôre looking for innit? Filter out all the rows not in that industry and save it into a new dataframe.

In [1151]:
# Filtery filter. (Save it to a new variable, df_salary_tech.)
industry_condition = df_salary['industry'] == 'Computing or Tech'
df_salary_tech = df_salary[industry_condition]
df_salary_tech

,timestamp,age,industry,title,title_context,salary,additional_compensation,currency,other_currency,salary_context,country,state,city,total_yoe,field_yoe,highest_education_completed,gender,race
1,4/27/2021 11:02:22,25-34,Computing or Tech,Change & Internal Communications Manager,NaN,"54,600",4000.0,GBP,NaN,NaN,United Kingdom,NaN,Cambridge,8 - 10 years,5-7 years,College degree,Non-binary,White
8,4/27/2021 11:03:01,45-54,Computing or Tech,Systems Analyst,Data developer/ETL Developer,"112,000",10000.0,USD,NaN,NaN,US,Missouri,St. Louis,21 - 30 years,21 - 30 years,College degree,Woman,White
43,4/27/2021 11:04:04,25-34,Computing or Tech,Principal Software Engineer,NaN,"187,500",5000.0,USD,NaN,NaN,United States,Pennsylvania,Pittsburgh,8 - 10 years,5-7 years,College degree,Woman,White
44,4/27/2021 11:04:04,25-34,Computing or Tech,Intelligence Analyst,NaN,"110,000",20000.0,USD,NaN,"Around 20,000 a year in stock",USA,Virginia,"Arlington, VA",8 - 10 years,8 - 10 years,Master's degree,Man,White
46,4/27/2021 11:04:07,35-44,Computing or Tech,Mobile developer,NaN,"144,600",2500.0,USD,NaN,NaN,USA,Massachusetts,Boston,5-7 years,5-7 years,PhD,Woman,White
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
28050,7/1/2024 13:38:46,25-34,Computing or Tech,Research & Systems Technician Data Analytics,NaN,22000,NaN,EUR,NaN,NaN,Spain,NaN,Barcelona,2 - 4 years,2 - 4 years,College degree,Man,"Hispanic, Latino, or Spanish origin"
28051,7/1/2024 20:05:58,25-34,Computing or Tech,Junior data analyst,NaN,35000,15000.0,USD,NaN,NaN,Usa,Alabama,Alabama,2 - 4 years,2 - 4 years,College degree,Woman,Black or African American
28052,7/3/2024 14:02:01,25-34,Computing or Tech,Senior Global Public Relations Manager,NaN,144000,15000.0,USD,NaN,NaN,Usa,Massachusetts,Boise-but remote. Company located in Boston,8 - 10 years,8 - 10 years,Master's degree,Woman,White
28058,7/23/2024 17:51:03,25-34,Computing or Tech,Systems Architect,NaN,109000,NaN,USD,NaN,NaN,USA,Georgia,Atlanta,5-7 years,5-7 years,College degree,Man,White
28060,7/26/2024 11:20:45,18-24,Computing or Tech,IT,NaN,1700,10.0,USD,NaN,NaN,Burma,NaN,Yangon,2 - 4 years,1 year or less,Some college,Man,Asian or Asian American

Do a sanity check to make sure that the only values you kept are the one you are filtered for.

In [1152]:
# Sanity Check 
df_salary_tech['industry'].value_counts()

industry
Computing or Tech    4699
Name: count, dtype: int64

We are very interested in salary figures. But how many dollars üíµ is a euro üí∂ or a pound üí∑? That sounds like a problem for another day. ü´†

For now, let‚Äôs just look at U.S. dollars (`'USD'`).

In [1153]:
# Filtery filter for just the jobs that pay in USD!
currency_condition = df_salary_tech['currency'] == 'USD'
df_salary_tech[currency_condition]

,timestamp,age,industry,title,title_context,salary,additional_compensation,currency,other_currency,salary_context,country,state,city,total_yoe,field_yoe,highest_education_completed,gender,race
8,4/27/2021 11:03:01,45-54,Computing or Tech,Systems Analyst,Data developer/ETL Developer,"112,000",10000.0,USD,NaN,NaN,US,Missouri,St. Louis,21 - 30 years,21 - 30 years,College degree,Woman,White
43,4/27/2021 11:04:04,25-34,Computing or Tech,Principal Software Engineer,NaN,"187,500",5000.0,USD,NaN,NaN,United States,Pennsylvania,Pittsburgh,8 - 10 years,5-7 years,College degree,Woman,White
44,4/27/2021 11:04:04,25-34,Computing or Tech,Intelligence Analyst,NaN,"110,000",20000.0,USD,NaN,"Around 20,000 a year in stock",USA,Virginia,"Arlington, VA",8 - 10 years,8 - 10 years,Master's degree,Man,White
46,4/27/2021 11:04:07,35-44,Computing or Tech,Mobile developer,NaN,"144,600",2500.0,USD,NaN,NaN,USA,Massachusetts,Boston,5-7 years,5-7 years,PhD,Woman,White
47,4/27/2021 11:04:09,35-44,Computing or Tech,Product Design Director,NaN,"200,850",40000.0,USD,NaN,NaN,USA,North Carolina,Chapel Hill,11 - 20 years,11 - 20 years,College degree,Woman,White
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
28044,6/3/2024 16:15:43,18-24,Computing or Tech,Research Data Analyst Associate,NaN,60000,0.0,USD,NaN,NaN,United States,Illinois,Evanston,2 - 4 years,1 year or less,College degree,Woman,White
28051,7/1/2024 20:05:58,25-34,Computing or Tech,Junior data analyst,NaN,35000,15000.0,USD,NaN,NaN,Usa,Alabama,Alabama,2 - 4 years,2 - 4 years,College degree,Woman,Black or African American
28052,7/3/2024 14:02:01,25-34,Computing or Tech,Senior Global Public Relations Manager,NaN,144000,15000.0,USD,NaN,NaN,Usa,Massachusetts,Boise-but remote. Company located in Boston,8 - 10 years,8 - 10 years,Master's degree,Woman,White
28058,7/23/2024 17:51:03,25-34,Computing or Tech,Systems Architect,NaN,109000,NaN,USD,NaN,NaN,USA,Georgia,Atlanta,5-7 years,5-7 years,College degree,Man,White
28060,7/26/2024 11:20:45,18-24,Computing or Tech,IT,NaN,1700,10.0,USD,NaN,NaN,Burma,NaN,Yangon,2 - 4 years,1 year or less,Some college,Man,Asian or Asian American

What we really want know is how each U.S. city pays in tech. What value in `country` represents the United States of America?

In [1154]:
# We did filter for USD, so if we do a count of each unique country in descending count order, the relevant value(s) should show up at the top.
df_salary_tech['country'].value_counts()

country
United States     1576
USA               1222
US                 413
Canada             227
United Kingdom     145
                  ...
International        1
England, UK          1
Portugal             1
Slovakia             1
Burma                1
Name: count, Length: 145, dtype: int64

### Clean the Data

Well, we can‚Äôt get our answers with what we currently have, so you‚Äôll have to make some changes.

Let‚Äôs not worry about anything below the first 5 values for now. Convert the top 5 to a single canonical value‚Äïsay, `'US'`, which is nice and short.

In [1155]:
# Replace them all with 'US'.
df_salary_tech['country'] = df_salary_tech['country'].replace(['United States', 'USA', 'Canada', 'United Kingdom'], 'US')

/var/folders/8b/80hh4jnn1xs8s6j0gf3_6lf80000gn/T/ipykernel_1508/2282604730.py:2: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  df_salary_tech['country'] = df_salary_tech['country'].replace(['United States', 'USA', 'Canada', 'United Kingdom'], 'US')

Have a look at the count of each unique country again now.

In [1156]:
# Count again.
df_salary_tech['country'].value_counts()

country
US                          3583
UK                           112
U.S.                         108
United States of America      90
Germany                       69
                            ...
International                  1
England, UK                    1
Slovakia                       1
Nederland                      1
Burma                          1
Name: count, Length: 141, dtype: int64

Did you notice anything interesting?

In [1157]:
# BONUS CREDIT: resolve [most of] those anomalous cases too without exhaustively taking every variant literally into account.
df_salary_tech['country'] = df_salary_tech['country'].replace(['United States of America', 'U.S.', 'United states', 'Usa'], 'US')

/var/folders/8b/80hh4jnn1xs8s6j0gf3_6lf80000gn/T/ipykernel_1508/2952374946.py:2: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  df_salary_tech['country'] = df_salary_tech['country'].replace(['United States of America', 'U.S.', 'United states', 'Usa'], 'US')

In [1158]:

# BONUS CREDIT: if you‚Äôve resolved it, let‚Äôs see how well you did by counting the number of instances of each unique value.
df_salary_tech['country'].value_counts()

country
US                3863
UK                 112
Germany             69
United States       68
USA                 56
                  ...
International        1
Portugal             1
Slovakia             1
Nederland            1
Burma                1
Name: count, Length: 137, dtype: int64

It‚Äôs looking good so far. Let‚Äôs find out the minimum, mean, and maximum (in that order) salary by state, sorted by the mean in descending order.

In [1159]:
# Find the minimum, mean, and maximum salary in USD by U.S. state.
# gb_states = df_salary_tech.groupby('state')

# gb_states['salary'].agg(['min', 'mean', 'max'])

Well, pooh! We forgot that `salary` isn‚Äôt numeric. Something wrong must be fixed.

In [1160]:
# Fix it.
df_salary_tech['salary'] = pd.to_numeric(df_salary_tech['salary'], errors='coerce')

/var/folders/8b/80hh4jnn1xs8s6j0gf3_6lf80000gn/T/ipykernel_1508/186558752.py:2: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  df_salary_tech['salary'] = pd.to_numeric(df_salary_tech['salary'], errors='coerce')

Let‚Äôs try that again.

In [1161]:
# Try it again. Yeah!
us_condition = df_salary_tech['country'] == 'US'
gb_states = df_salary_tech[us_condition].groupby('state')
gb_states['salary'].agg(['min', 'mean', 'max']).sort_values(['mean'], ascending=False)

                           min      mean        max
state
Florida                28800.0  210711.0  2600000.0
California, Oregon    200000.0  200000.0   200000.0
California, Colorado  176000.0  176000.0   176000.0
Delaware              169000.0  169000.0   169000.0
Connecticut            68000.0  161610.0   270000.0
...                        ...       ...        ...
Mississippi                NaN       NaN        NaN
New York, Texas            NaN       NaN        NaN
North Dakota               NaN       NaN        NaN
South Dakota               NaN       NaN        NaN
Utah, Vermont              NaN       NaN        NaN

[63 rows x 3 columns]

That did the trick! Now let‚Äôs narrow this to data 2021 and 2022 just because (lel). *(Hint: that timestamp column may not be a temporal type right now.)*

In [1162]:
# Filter the data to within 2021, 2022, or 2023, saving the DataFrame to a new variable, and generate the summary again.
# df_salary_tech['timestamp'].dtype
df_salary_tech['timestamp'] = pd.to_datetime(df_salary_tech['timestamp'])
year_condition = (pd.DatetimeIndex(df_salary_tech['timestamp']).year >= 2021) & (pd.DatetimeIndex(df_salary_tech['timestamp']).year <= 2023)

df_salary_tech[year_condition]

/var/folders/8b/80hh4jnn1xs8s6j0gf3_6lf80000gn/T/ipykernel_1508/3336284791.py:3: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  df_salary_tech['timestamp'] = pd.to_datetime(df_salary_tech['timestamp'])

,timestamp,age,industry,title,title_context,salary,additional_compensation,currency,other_currency,salary_context,country,state,city,total_yoe,field_yoe,highest_education_completed,gender,race
1,2021-04-27 11:02:22,25-34,Computing or Tech,Change & Internal Communications Manager,NaN,NaN,4000.0,GBP,NaN,NaN,US,NaN,Cambridge,8 - 10 years,5-7 years,College degree,Non-binary,White
8,2021-04-27 11:03:01,45-54,Computing or Tech,Systems Analyst,Data developer/ETL Developer,NaN,10000.0,USD,NaN,NaN,US,Missouri,St. Louis,21 - 30 years,21 - 30 years,College degree,Woman,White
43,2021-04-27 11:04:04,25-34,Computing or Tech,Principal Software Engineer,NaN,NaN,5000.0,USD,NaN,NaN,US,Pennsylvania,Pittsburgh,8 - 10 years,5-7 years,College degree,Woman,White
44,2021-04-27 11:04:04,25-34,Computing or Tech,Intelligence Analyst,NaN,NaN,20000.0,USD,NaN,"Around 20,000 a year in stock",US,Virginia,"Arlington, VA",8 - 10 years,8 - 10 years,Master's degree,Man,White
46,2021-04-27 11:04:07,35-44,Computing or Tech,Mobile developer,NaN,NaN,2500.0,USD,NaN,NaN,US,Massachusetts,Boston,5-7 years,5-7 years,PhD,Woman,White
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
27964,2023-06-15 11:57:09,25-34,Computing or Tech,Junior Developer,NaN,22000.0,0.0,GBP,NaN,NaN,united kingdom,NaN,northampton,1 year or less,1 year or less,Master's degree,Woman,Asian or Asian American
27971,2023-08-08 07:12:10,25-34,Computing or Tech,Data scientist,NaN,500.0,NaN,USD,NaN,NaN,Ghana,NaN,Accra,2 - 4 years,2 - 4 years,College degree,Man,Black or African American
27975,2023-09-08 12:35:45,18-24,Computing or Tech,intern,NaN,35000.0,0.0,USD,NaN,NaN,US,Texas,Dallas,1 year or less,1 year or less,Master's degree,Man,Asian or Asian American
27989,2023-10-26 08:17:05,18-24,Computing or Tech,Ibterb,NaN,456.0,NaN,USD,NaN,NaN,Nigeria,NaN,Lagos,2 - 4 years,2 - 4 years,College degree,Man,Another option not listed here or prefer not t...
27992,2023-11-17 04:19:55,18-24,Computing or Tech,Java Software Developer,Internship,17760.0,NaN,EUR,NaN,NaN,France,NaN,Paris,1 year or less,1 year or less,Master's degree,Man,White

## Bonus

Clearly, we do not have enough data to produce useful figures for the level of specificity you‚Äôve now reached. What do you notice about Delaware and West Virginia?

Let‚Äôs back out a bit and return to `df_salary` (which was the loaded data with renamed columns but *sans* filtering).

In [1163]:
delaware_condition = df_salary_tech['state'] == 'Delaware'
west_virginia_condition = df_salary_tech['state'] == 'West Virginia'
df_salary_tech[delaware_condition | west_virginia_condition]

,timestamp,age,industry,title,title_context,salary,additional_compensation,currency,other_currency,salary_context,country,state,city,total_yoe,field_yoe,highest_education_completed,gender,race
2543,2021-04-27 11:46:19,35-44,Computing or Tech,Principal Test Engineer,Oversee a small team of software testers.,NaN,NaN,USD,NaN,NaN,US,West Virginia,Morgantown,11 - 20 years,11 - 20 years,Master's degree,Man,White
3608,2021-04-27 12:11:21,35-44,Computing or Tech,Vice President of Operations,"Internal business operations (HR, IT, Finance,...",NaN,500.0,USD,NaN,NaN,US,Delaware,Newark,11 - 20 years,11 - 20 years,College degree,Woman,White
15620,2021-04-28 17:13:18,35-44,Computing or Tech,IT Director,NaN,NaN,5000.0,USD,NaN,NaN,United States,Delaware,Exton,11 - 20 years,11 - 20 years,High School,Man,White
16444,2021-04-28 17:57:43,35-44,Computing or Tech,Associate Software Engineer,NaN,NaN,6000.0,USD,NaN,NaN,US,Delaware,Newark,5-7 years,2 - 4 years,College degree,Woman,White
17112,2021-04-28 19:24:43,35-44,Computing or Tech,Product manager,NaN,NaN,8000.0,USD,NaN,NaN,US,Delaware,Wilmington,8 - 10 years,2 - 4 years,PhD,Woman,White
18695,2021-04-29 01:54:06,45-54,Computing or Tech,software engineer,NaN,NaN,0.0,USD,NaN,NaN,US,West Virginia,Clarksburg,11 - 20 years,11 - 20 years,College degree,Man,White
22164,2021-04-30 18:04:04,45-54,Computing or Tech,AVP portfolio manager,Manage multiple applications fir a Fortune 500...,169000.0,30000.0,USD,NaN,NaN,US,Delaware,Wilmington,31 - 40 years,31 - 40 years,College degree,Woman,White
23243,2021-05-01 21:38:05,45-54,Computing or Tech,Team Lead,NaN,120000.0,NaN,USD,NaN,NaN,US,West Virginia,Charleston,21 - 30 years,21 - 30 years,College degree,Woman,White

### Bonus #0

Apply the same steps as before to `df_salary`, but do not filter for any specific industry. Do perform the other data cleaning stuff, and get to a point where you can generate the minimum, mean, and maximum by state.

In [1164]:
# df_salary['country'].value_counts()
df_salary['country'] = df_salary['country'].replace(['United States', 'USA', 'Canada', 'United Kingdom', 'Usa', 'United states', 'U.S.'], 'US')
df_salary['salary'] = pd.to_numeric(df_salary['salary'], errors='coerce')
# df_salary['country'].value_counts()

us_statement = df_salary['country'] == 'US'
gb = df_salary[us_statement].groupby('state')
gb['salary'].agg(['min', 'mean', 'max']).sort_values(['mean'], ascending=False)

                             min           mean        max
state
California, Oregon      200000.0  200000.000000   200000.0
California, Colorado    176000.0  176000.000000   176000.0
New Jersey               14850.0  140505.362745  5000044.0
New Jersey, New York    135000.0  138666.666667   141000.0
Indiana, Massachusetts  132000.0  132000.000000   132000.0
...                          ...            ...        ...
North Carolina, Utah         NaN            NaN        NaN
Ohio, Washington             NaN            NaN        NaN
Ohio, Wyoming                NaN            NaN        NaN
Texas, Virginia              NaN            NaN        NaN
Utah, Vermont                NaN            NaN        NaN

[118 rows x 3 columns]

### Bonus #1

This time, format the table output nicely (*$12,345.00*) without modifying the values in the `DataFrame`. That is, `df_salary` should be identical before versus after running your code.

(*Hint: if you run into an error about `jinja2` perhaps you need to `pip install` something.*)

### Bonus #2

Filter out the non-single-states (e.g., `'California, Colorado'`) in the most elegant way possible (i.e., *not* by blacklisting all the bad values).

### Bonus #3

Show the quantiles instead of just minimum, mean, and maximum‚Äïsay 0%, 5%, 25%, 50%, 75%, 95%, and 100%. Outliers may be deceiving.

Sort by whatever interests you‚Äïlike say the *50th* percentile.

And throw in a count by state too. It would be interesting to know how many data points contribute to the figures for each state. (*Hint: your nice formatting from Bonus #1 might not work this time around.* üòú)